micropython/micropython/ports/raspberrypi/boards/hack_club_sprig/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "Hack Club Sprig"
#define MICROPY_HW_MCU_NAME "rp2040"

#define MICROPY_HW_LED_STATUS (&pin_GPIO4)
